# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!
  
#### Import all the necessary libraries here:

In [32]:
# Libraries
import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np

import seaborn as sns

import matplotlib.pyplot as plt
%matplotlib inline

import statsmodels.api as sm
from statsmodels.formula.api import ols

from sklearn import linear_model

# Challenge 1

#### Read the `employees` dataset from Ironhack's database:
* db: `employees`
* table: `employees`

Save your data in a variable called `employees`.

In [54]:
# your code here
path = '../../../../lessons/data/'

employees = pd.read_csv(path+'Employee.csv')
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean `Salary` by `Department`?
**Tip**: There are 2 ways to do it: with or without pivot tables. Do it both ways.

In [14]:
# Method 1
# your code here
salary_mean1 = employees.groupby('Department').agg({'Salary':'mean'})
print(salary_mean1)

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

In [23]:
# Method 2
# your code here
salary_mean2 = employees.pivot_table(values='Salary', index='Department')
print(salary_mean2)

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### Now, group the data by more than one column. Use Pandas pivot table function to select the mean `Salary` by `Department` and `Title`.

In [25]:
# your code here
salarymean = employees.pivot_table(values='Salary', index=['Department', 'Title'])
print(salarymean)

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### Display the number of `Years` of work experience and the `Salary` for each `Title`. Add `Years` as a column in your pivot table.
**Hint**: Use Pandas documentation to explore the [pivot table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) function.

In [29]:
# your code here
experience = employees.pivot_table(values='Salary', index='Title', columns='Years')
print(experience)

Years         1     2     3     4     7     8
Title
VP          NaN   NaN   NaN   NaN   NaN  70.0
analyst    35.0  30.0   NaN  35.0   NaN   NaN
associate   NaN  55.0  55.0   NaN  60.0   NaN

#### Find the mean `Salary` and number of employees in each `Department` and for each job `Title`.

In [40]:
# your code here
salary_title = employees.pivot_table(values='Salary', index='Department', columns='Title', aggfunc=['mean','count'])
print(salary_title)

            mean                   count
Title         VP analyst associate    VP analyst associate
Department
HR          70.0    32.5       NaN   1.0     2.0       NaN
IT          70.0    32.5      60.0   1.0     2.0       1.0
Sales        NaN     NaN      55.0   NaN     NaN       2.0

#### For each `Department` and each job `Title`, find the `Salary` median, minimum, maximum and standard deviation. Comment your results.

In [44]:
# your code here
all_info = employees.pivot_table(index='Department', 
                                 columns='Title',
                                 values='Salary',
                                 aggfunc=['median',
                                         'min',
                                         'max',
                                         'std'])
all_info

           median                     min                     max          \
Title          VP analyst associate    VP analyst associate    VP analyst
Department
HR           70.0    32.5       NaN  70.0    30.0       NaN  70.0    35.0
IT           70.0    32.5      60.0  70.0    30.0      60.0  70.0    35.0
Sales         NaN     NaN      55.0   NaN     NaN      55.0   NaN     NaN

                           std
Title      associate   analyst associate
Department
HR               NaN  3.535534       NaN
IT              60.0  3.535534       NaN
Sales           55.0       NaN       0.0

In [ ]:
"""
your commments here
"""
'''
According to provided data, 
at the same level of seniority, departmental salary does not differentiate from one to another;
salary level seems to be the same across departments in general;
for VP positions, salary level is fixed across departments;
for Analyst positions, salary varies within range of 30 and 35;
there isn't enough data to develope insights of sales department;
there isn't enough data to develope insights of associate positions.
'''

#### Based on your comments, fill the missing values with an appropriate value.

In [46]:
# your code here
employees.pivot_table(index='Department', 
                     columns='Title',
                     values='Salary',
                     aggfunc=['median',
                             'min',
                             'max',
                             'std'],
                     fill_value=0)

           median                   min                   max          \
Title          VP analyst associate  VP analyst associate  VP analyst
Department
HR             70    32.5         0  70      30         0  70      35
IT             70    32.5        60  70      30        60  70      35
Sales           0     0.0        55   0       0        55   0       0

                           std
Title      associate   analyst associate
Department
HR                 0  3.535534         0
IT                60  3.535534         0
Sales             55  0.000000         0

#### The stake holders want to know, for each `Department`, the number of employees and how much money is spent on salaries. Could you provide that information?

In [49]:
# your code here
dpt_budget = employees.pivot_table(index='Department', 
                                   values='Salary', 
                                   aggfunc=['sum','count'])
dpt_budget

              sum  count
           Salary Salary
Department
HR            135      3
IT            195      4
Sales         110      2

#### For each `Department` and `Title`, find the the total years of work experience and the mean `Salary`.

In [50]:
# your code here
employees.pivot_table(index='Department', 
                      columns='Title', 
                      values=['Years','Salary'], 
                      aggfunc={'Years':'sum','Salary':'mean'})

           Salary                   Years
Title          VP analyst associate    VP analyst associate
Department
HR           70.0    32.5       NaN   8.0     6.0       NaN
IT           70.0    32.5      60.0   8.0     3.0       7.0
Sales         NaN     NaN      55.0   NaN     NaN       5.0

## Bonus Challenge 1

#### Compute the mean `Salary` after removing the maximum `Salary` for each `Department`. Create the appropriate pivot table.
**Hint**: Write a custom function.

In [53]:
# your code here
def findMean(df_s):
    import numpy as np
    l_max = df_s.max()
    list(df_s).remove(l_max)
    return np.mean(list(df_s))

employees.pivot_table(index='Department', values='Salary', aggfunc=findMean)

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

# Challenge 2

#### Read the `fitbit` dataset from Ironhack's database:
* db: `fitbit`
* table: `fitbit`

Save your data in a variable called `fitbit`.

In [55]:
# your code here
fitbit = pd.read_csv(path+'Fitbit2.csv')
fitbit.head()

,Date,Calorie burned,Steps,Distance,Floors,Minutes Sedentary,Minutes Lightly Active,Minutes Fairly Active,Minutes Very Active,Activity Calories,MinutesOfSleep,MinutesOfBeingAwake,NumberOfAwakings,LengthOfRestInMinutes,Distance_miles,Days,Days_encoded,Work_or_Weekend,Hours Sleep,Sleep efficiency,Yesterday_sleep,Yesterday_sleep_efficiency,Months,Months_encoded
0,2015-05-08,1934,905,0.65,0,1.355,46,0,0,1680,384,26,23,417,0.403891,Friday,4.0,1,6.400000,92.086331,0.000000,0.000000,May,5
1,2015-05-09,3631,18925,14.11,4,611.000,316,61,60,2248,454,35,21,491,8.767545,Saturday,5.0,0,7.566667,92.464358,6.400000,92.086331,May,5
2,2015-05-10,3204,14228,10.57,1,602.000,226,14,77,1719,387,46,25,436,6.567891,Sunday,6.0,0,6.450000,88.761468,7.566667,92.464358,May,5
3,2015-05-11,2673,6756,5.02,8,749.000,190,23,4,9620,311,31,21,350,3.119282,Monday,0.0,1,5.183333,88.857143,6.450000,88.761468,May,5
4,2015-05-12,2495,502,3.73,1,876.000,171,0,0,7360,407,65,44,491,2.317714,Tuesday,1.0,1,6.783333,82.892057,5.183333,88.857143,May,5

#### Explore you dataset in terms of data types and descriptive statistics.
**Hint**: Use Pandas functions from previous lectures.

In [ ]:
# your code here

#### You suspect that there must be a linear relationship between the `Minutes Very Active` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Very active` vs `Steps`. We'll work with matplotlib next week. As a first introduction, uncomment and complete the following code. You need to replace the # symbol for the correct function arguments.

In [ ]:
import matplotlib.pyplot as plt;

In [ ]:
"""
plt.scatter(#, #)
plt.title(#)
plt.xlabel(#)
plt.ylabel(#)
plt.show()
"""

#### What can you say about `Minutes Very Active` and `Steps`? Write a comment below.

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `Minutes Sedentary` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Sedentary` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `MinutesOfSleep` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `MinutesOfSleep` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`.

In [ ]:
columns = ['Calorie burned', 'Steps', 'Floors', 'Minutes Sedentary', 'Minutes Very Active', 'MinutesOfSleep']

In [ ]:
# your code here

#### Based on the result of the correlation matrix, which of the features are highly correlated with variable `Steps`?
**Hint**: sort the correlations of `Steps` vs the rest of the features in descending order. You can use Pandas `sort_values`.

In [ ]:
# your code here

# Challenge 3

#### Read the `time_grades` dataset from Ironhack's database:
* db: `time_grades`
* table: `time_grades`

Save your data in a variable called `time_grades`.

In [ ]:
# your code here

#### Show visually the frequency distribution of the `time_grades` dataset.

In [ ]:
# your code here

#### Is there a correlation between `Study time` and `Grade`? Use both Pearson and Spearman correlations and comment your results.

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Use matplotlib to visually plot `Study time` vs `Grade`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Could you explain the difference between Pearson and Spearman correlations?

In [ ]:
"""
your commments here
"""